benchmarking/kqueue-test-1.txt
Running 5s test @ http://localhost:8080/health
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.09ms    7.09ms 113.83ms   98.72%
    Req/Sec     3.77k     1.88k    6.19k    70.33%
  Latency Distribution
     50%    2.34ms
     75%    2.77ms
     90%    3.20ms
     99%   16.34ms
  34550 requests in 5.09s, 3.43MB read
  Socket errors: connect 0, read 34550, write 0, timeout 0
Requests/sec:   6788.30
Transfer/sec:    689.44KB